import Container from "@/components/Container";
import Image from "next/image";
import aboutPic from "../../../public/images/311571751_104132715819610_3555219688868392360_n.jpg";

const aboutUs = () => {
  return (
    <div className="mt-36 px-4">
      <Container>
        <div className="flex justify-between flex-col-reverse md:flex-row gap-8">
          <div className="md:w-[60%]">
            <h1 className="text-[24px] font-medium pb-2">شركة إيجيبت لادرز</h1>
            <p className="text-[17px] pb-1">
              هي إحدي اكبر شركات صناعة السلالم الاألومنيوم في مصر والشرق الاوسط
              وافريقيا.
            </p>
            <p className="text-[17px] pb-1">
              تأسست الشركة في عام 2003 وتقدم للعملاء مجموعة متنوعة من السلالم
              متعددة الاغراض سلالم منزلية وسلالم.
            </p>
            <p className="text-[17px] pb-1">
              للاستعمال الصناعي الشاق وسلالم أبراج وسقالات تناسب جميع الارتفاعات
              والمشايات البحري والباليتات وغيرها واستطاعة الشركة ان تنال ثقة
              الشركات والمؤسسات الكبري في جميع القطاعات في مصر وصولا للتصدير
              لتميز منتجاتنا بجودة التصنيع وخفة الوزن وأثصي درجات القوة الامان.
            </p>
            <p className="text-[17px] pb-1">
              ومضنعنا بمدينة بدر علي مساحة 4500 متر مربع والتي تشمل ورش عمل
              حديثة علي مساحة 3000 متر مبرع وخطوط انتاج أوتوماتيكية حديثة واحدث
              وسائل اللحام ولدينا موظفين ذو خبره يتعاملون مع الطلبات بكل دقة
              ومراقبة الجودة جزء من نظام ادارة الجودة لدينا نستخدم سبائك
              الاألومنيوم من خام بيور مصنع خصيصا للتتوافق مع المواصفات الاوروبية
              الخاصة بحمولات السبائك وطرق التصنيع.
            </p>
            <p className="text-[17px] pb-1">
              كما نرسل موظفينا الي موردي خام الالومنيوم لدينا لتنفيذ عمليات
              مراقبة لطلبياتنا للتاكد من ان المواد الخام لمنتجاتنا طبقا
              للمواصفات .
            </p>
            <p className="text-[17px] pb-1">
              إيجيبت لادرز تعمل مع موردين ذو ثقة ولدينا فنيين ومهندسين ومطورين
              ذو خبره عالية يمكن تطوير المنتجات الخاصة وتصميمها وفقا لمتطلبات
              العملاء وإيجيبت لادرز تسعي دائما للحفاظ علي التكاليف لتقديم اسعار
              تنافسية بأعلي جودة لذلك نستخدم التجميع الاتوماتيكي والتي تتيح
              لمنتجاتنا ان تكون اكثر احكاما وقوة واقل تكلفه.
            </p>
            <p className="text-[17px] pb-1">
              ومنتجاتنا متوافقة مع معايير السلامة وطبقا للمواصفات الاوروبية حيث
              ان ISO إيجيبت لادرو حاصلة علي شهادات الجودة العالية والاسعار
              التنافسية تساعدنا علي التصدير بشكل جيد في دول
            </p>
            <ul className="text-[17px] pb-1 px-2">
              <li>- جنوب افريقيا </li>
              <li>- ودول الخليج </li>
            </ul>
          </div>
          <div className="bg-gray-400 text-center text-4xl my-5  md:h-[500px] md:w-[40%] rounded-md py-[150px] md:py-0">
            <Image
              src={aboutPic}
              alt="about us"
              className="h-full rounded-md"
            />
          </div>
        </div>
      </Container>
    </div>
  );
};

export default aboutUs;
